print('Завдання 1 і 2')
y = int(input('Введіть число: '))
if y%2 != 0:
    print('Число непарне.')
else:
    print('Число парне.')

if y%7 == 0:
    print('Число кратне 7.')
else:
    print('Число некратне 7.')
print()
print('Завдання 3 і 4')
w = int(input('Введіть перше число: '))
y = int(input('Введіть друге число: '))
if w > y:
    print('Найбільше число ', w, '\nНайменьше число', y)
if w < y:
    print('Найбільше число ', y, '\nНайменьше число', w)
else:
    print('Числа рівні')

print()
print('Завдання 5')
w = int(input('Введіть перше число: '))
y = int(input('Введіть друге число: '))
diya = input('Виберіть дію: сума, різниця, добуток, середнє арифметичне: ')
if diya == 'сума':
    print(w + y)
if diya == 'різниця':
    print(w - y)
if diya == 'добуток':
    print(w * y)
if diya == 'середнє арифметичне':
    print((w + y)/2)