print('Завдання 1')
print()
x = int(input('Введіть перше число: '))
y = int(input('Введіть друге число: '))
z = int(input('Введіть третє число: '))
rezult = input('Яка дія потрібна, сума або добуток: ')
if rezult == 'сума':
    print(x + y + z)
if rezult == 'добуток':
    print(x * y * z)

print()
print('Завдання 2')
# Числа не потрібні дорівнюватись один одному :-)
x = int(input('Введіть перше число: '))
y = int(input('Введіть друге число: '))
z = int(input('Введіть третє число: '))
rezult = input('Що потрібно знайти, максимальне число, мінімальне число, середньоарифметичне? ')
if rezult == 'максимальне число':
    if x > y and x > z:
        print('Максимальне число', x)
    if y > x and y > z:
        print('Максимальне число', y)
    if z > x and z > y:
        print('Максимальне число', z)
if rezult == 'мінімальне число':
    if x < y and x < z:
        print('Мінімальне число', x)
    if y < x and y < z:
        print('Мінімальне число', y)
    if z < x and z < y:
        print('Мінімальне число', z)
if rezult == 'середньоарифметичне':
    print((x + y + z)/3)

print()
print('Завдання 3')
m = int(input('Введіть кількість метрів '))
conv = input('В яку одиницю конвертуємо метри? Милі, дюйми, ярди: ')
if conv == 'милі':
    print(m, 'метрів дорівнює ', m * 0.00062137, 'миль')
if conv == 'дюйми':
    print(m, 'метрів дорівнює ', m * 39.37, 'дюймів')
if conv == 'ярди':
    print(m, 'метрів дорівнює ', m * 1.0936, 'ярдів')

