print('Завдання 1')
x = int(input('Введіть секунди з начала доби '))
y = input('Що потрібно порахувати: години, хвилини, секунди? ')
if y == 'години':
    print('До кінця доби залишилось ', 24 - x // 3600, 'годин.')
if y == 'хвилини':
    print('До кінця доби залишилось ', 24 * 60 - x // 60, 'хвилин.')
if y == 'секунди':
    print('До кінця доби залишилось ', 24 * 3600 - x, 'секунд.')

print()
print('Завдання 2')
r = int(input('Введіть радіус кола '))
rezult = input('Виберіть що рахуємо: площа чи периметр: ')
if rezult == 'площа':
    print('Площа кола ', 3.14 * r ** 2)
if rezult == 'периметр':
    print('Периметр кола ', 2 * 3.14 * r)

print()
print('Завдання 3')
ps = int(input('Введіть ціну однієї приставки: '))
pieces = int(input('Введіть кількість приставок: '))
discount = int(input('Введіть відсоток знижки: '))
rezult = input('Що подрібно порахувать, сума чи одна приставка: ')
if rezult == 'сума':
    print('Загальна сума замовлення з урахуванням знижки', ps * pieces * (1- discount / 100))
if rezult == 'одна приставка':
    print('Вартість однієї приставки з урахуванням знижки', ps * (1 - discount / 100))

print()
print('Завдвння 5')
hours = int(input('Введіть кількість годин '))
if hours < 6:
    print('Good night')
if 6 <= hours < 13:
    print('Good morning')
if 13 <= hours < 17:
    print('Good day')
if hours >= 17 or hours == 0:
    print('Good evening')



